{
  "head": {
    "index": {
      "title": "Daniel Rötzer | Lebenslauf"
    },
    "about": {
      "title": "Daniel Rötzer | Über Diese Seite"
    },
    "projects": {
      "title": "Daniel Rötzer | Meine Projekte"
    }
  },
  "print": {
    "text": "Drucken"
  },
  "links": {
    "index": "Lebenslauf",
    "about": "Über Diese Seite",
    "projects": "Meine Projekte",
    "contact": "Kontakt",
    "german": "Deutsch",
    "english": "Englisch"
  },
  "introduction": {
    "developer": "Webentwickler"
  },
  "index": {
    "education": {
      "title": "Ausbildung",
      "school": {
        "title": "IT-HTL Ybbs",
        "subtitle": "(2011 - 2017)",
        "text": "Ausbildungschwerpunkt Medientechnik."
      }
    },
    "internships": {
      "title": "Ferialpraxis",
      "A1": {
        "title": "A1 Telekom Austria",
        "subtitle": "(Juli 2011, Juli 2014)",
        "ul": [
          "Installation und Konfiguration von Betriebssystemen",
          "Mithilfe bei den Installationen von POTS-, ISDN-, ADSL- und Business-Anschlüssen",
          "Entstörung von A1-TV"
        ]
      },
      "Quarzwerke": {
        "title": "Quarzwerke Melk",
        "subtitle": "(Juli 2016)"
      }
    },
    "experience": {
      "title": "Berufserfahrung",
      "it-center": {
        "title": "IT-Center Ybbs",
        "subtitle": "(19. März 2018 - 1. Februar 2019)",
        "text": "Entwicklung und Betreuung zweier Apps, für Android und IOS, mithilfe des Ionic Frameworks (Angular, SCSS, HTML, Cordova). Verwaltung und Weiterentwicklung der zugehörigen Webseite"
      }
    },
    "knowledge": {
      "title": "Spezielle IT-Kenntnisse",
      "grading": "(1 = sehr gute Kenntnisse, 2 = gute Kenntnisse, 3 = Grundkenntnisse)",
      "programming": {
        "title": "Programmieren",
        "ul": [
          "C, C#, Java (2)",
          "Android, IOS (3)"
        ]
      },
      "webdev": {
        "title": "Webentwicklung",
        "ul": [
          "HTML5, CSS, SCSS/LESS, JavaScript/Typescript, Ionic Framework, Node.js, RethinkDB (1)",
          "Gulp/Grunt, PHP, Socket.IO (2)",
          "Nuxt.js, Vue.js (3), Angular (3)"
        ]
      },
      "other": {
        "title": "Weitere gesammelte Kenntnisse",
        "ul": [
          "Typo3, Oracle, Netwerktechnik und Netzwerksicherheit (3)"
        ]
      }
    },
    "language": {
      "title": "Sprachkenntnisse",
      "text": "Deutsch und Englisch - Maturaniveau"
    },
    "hobbies": {
      "title": "Hobbys",
      "text": "Snowboarden, Schwimmen, Fußball, Lesen, Landschaftsmalerei"
    },
    "personal": {
      "title": "Persönliche Eigenschaften",
      "text": "Selbstständiges Arbeiten, Hilfsbereitschaft, Erworbene Teamfähigkeiten im Fußballverein SCU Emmersdorf"
    }
  },
  "about": {
    "purpose": {
      "title": "Welchen Zweck erfüllt diese Webseite?",
      "text": "Diese Webseite ist ein persönliches Projekt und dient als Referenz, für meine Projekte und Erfahrungen."
    },
    "tools": {
      "title": "Welche Utilities oder Tools wurden für die Entwicklung benutzt?",
      "text": "Neben dem Hauptziel, eine Portfolio Webseite für mich zu entwickeln, sind die anderen 2 Hauptfaktoren: Responsiveness und Schnelligkeit. Meine Webseite soll nicht nur vollständig responsive sein, sondern auch sehr schnell. In Anbetracht meiner Ziele, beschreibe ich folgend welche Tools ich Nutze und warum.",
      "nuxt": "Ich habe mich für Nuxt.js entschieden, weil es den Build-Prozess stark vereinfacht und Vue.js verwendet. Des Weiteren können mit Nuxt Server Side Rendered Applikationen erstellt werden, was deutliche Vorteile für SEO mitbringt. Außerdem ist es möglich, die Webseite als statisch generierte Vue Applikation zu exportieren, womit die Performance stark gesteigert wird.",
      "tailwind": "Für dieses Projekt habe ich mich gegen eine Frontend Component Bibliothek wie Bootstrap oder Bulma entschieden, weil diese nicht in mein vorgestelltes Design passten. Trotzdem benötigte ich ein responsive Grid, weswegen ich mich für Tailwind CSS entschieden habe.",
      "netlify": "Um meine Webseite zu hosten, benutze ich Netlify. Dieser Dienst bietet gute, gratis Nutzungsoptionen und der Veröffentlichungsprozess könnte nicht einfacher sein. Einmal Konfiguriert, veröffentlicht Netlify automatisch mein Projekt vom Master Branch aus meinem GitLab Repository. Ich muss lediglich meine Änderungen in den Master Branch pushen und Netlify erledigt den Rest."
    },
    "contact": {
      "title": "Kontakt",
      "text": "Ich bin erreichbar unter:"
    }
  },
  "projects": {
    "school": "Schulprojekte",
    "work": "Arbeitsprojekte",
    "personal": "Persönliche Projekte",
    "jada": {
      "title": "JaDa",
      "subtitle": "HTML, JavaScript, LESS, Grunt",
      "content": "JaDa war ein halbjähriges Projekt von einem Klassenkollegen und mir. Das Ziel war es neue Technologien wie LESS und Grunt kennenzulernen. Dabei entschieden wir uns eine eigene Frontend-Content-Library zu entwickeln, welche als Vorbild Bootstrap verwendet. Wir dachten dies sei der Beste Weg, um intensiv mit diesen Technologien zu arbeiten."
    },
    "rtvs": {
      "title": "Real Time Voting System",
      "subtitle": "Node.js, RethinkDB, Gulp, Stylus",
      "content": "Bei RTVS (wie der Name bereits verrät) handelt es sich um ein Voting System, welches die Ergebnisse in Echtzeit anzeigt. Hierbei habe ich die Serverlogik mit Node.js realisiert. Mithilfe der Echtzeitfähigkeit von RethinkDB und Socket.io, werden neue Datensätze automatisch am Client aktualisiert (ohne das Fenster neu zu laden)."
    },
    "hfw": {
      "title": "hello friends Webseite",
      "subtitle": "PHP, jQuery, CSS",
      "content": "Hello friends ist ein Cashback System, bei dem man bei bestimmten Partnern einen gewissen Betrag seines Einkaufs, als Friendsbonus geschenkt bekommt. Des Weiteren kann man auf der Webseite und in der App Essen bestellen, sowie den gesammelten Friendsbonus einlösen."
    },
    "hfc": {
      "title": "hello friends App",
      "subtitle": "Ionic Framework (Angular, SCSS, HTML, Cordova)",
      "content": "Die hello friends App wurde zugehörig zur Webseite entwickelt, wo man ebenfalls Essen bestellen und einen Friendsbonus sammeln kann. Der gesammelte Friendsbonus wird im Benutzer Account gespeichert. Mit dem QrCode aus der App kann man diesen bei jeglichen Partnern an der Kassa einlösen. Das Ionic Framework ermöglichte es mir, die App für IOS und Android gleichzeitig zu entwickeln. Ich habe die Apps also vollständig alleine entwickelt und betreut."
    },
    "hfp": {
      "title": "DELIVERY Partner App",
      "subtitle": "Ionic Framework (Angular, SCSS, HTML, Cordova)",
      "content": "Die Bestellungen, die über die hello friends Webseite oder App getätigt werden, kann der Partner in dieser App verwalten. Die App ermöglicht es neue Bestellungen auszudrucken (via Bluetooth), Lieferzeiten zu ändern, Lieferadresse in Google Maps anzuzeigen etc. DELIVERY Partner wurde ebenfalls von mir alleine verwaltet und entwickelt, ist aber nur für Android verfügbar."
    }
  }
}