{
  "print": {
    "text": "Print"
  },
  "links": {
    "index": "Curriculum Vitae",
    "about": "About this Site",
    "projects": "Projects",
    "contact": "Contact",
    "german": "German",
    "english": "English"
  },
  "introduction": {
    "developer": "Web Developer"
  },
  "index": {
    "education": {
      "title": "Education",
      "school": {
        "title": "IT-HTL Ybbs",
        "subtitle": "(2011 - 2017)",
        "text": "Main focus on media technologies"
      }
    },
    "internships": {
      "title": "Summer Internships",
      "A1": {
        "title": "A1 Telekom Austria",
        "subtitle": "(Juli 2011, Juli 2014)",
        "ul": [
          "Installation and configuration of operating systems",
          "Support in installation of POTS-, ISDN-, ADSL- and Business-Interfaces",
          "Troubleshooting of A1-TV"
        ]
      },
      "Quarzwerke": {
        "title": "Quarzwerke Melk",
        "subtitle": "(Juli 2016)"
      }
    },
    "experience": {
      "title": "Work Experience",
      "it-center": {
        "title": "IT-Center Ybbs",
        "subtitle": "(19. März 2018 - 1. Februar 2019)",
        "text": "Development and administration of 2 Apps for Android and IOS, with the Ionic Framework (Angular, SCSS, HTML, Cordova). Maintenance and development of the corresponding Website"
      }
    },
    "knowledge": {
      "title": "Special IT-Knowledge",
      "grading": "(1 = advanced knowledge, 2 = good knowledge, 3 = basic knowledge)",
      "programming": {
        "title": "Programming",
        "ul": [
          "C, C#, Java (2)",
          "Android, IOS (3)"
        ]
      },
      "webdev": {
        "title": "Web Development",
        "ul": [
          "HTML5, CSS, SCSS/LESS, JavaScript/Typescript, Ionic Framework, Node.js, RethinkDB (1)",
          "Gulp/Grunt, PHP, Socket.IO (2)",
          "Nuxt.js, Vue.js (3), Angular (3)"
        ]
      },
      "other": {
        "title": "Other",
        "ul": [
          "Typo3, Oracle, network technology and security (3)"
        ]
      }
    },
    "language": {
      "title": "Linguistic Proficiency",
      "text": "German and English with Diploma"
    },
    "hobbies": {
      "title": "Hobbies",
      "text": "Snowboarding, swimming, football (soccer), reading, landscape painting"
    },
    "personal": {
      "title": "Personal Qualities",
      "text": "Independent working, helpfullnes, gained team skills in the football club SCU Emmersdorf"
    }
  },
  "about": {
    "purpose": {
      "title": "What purpose has this website?",
      "text": "This website is a personal project and serves as reference, for my projects and experience."
    },
    "tools": {
      "title": "What utilities or tools where used for development?",
      "text": "Besides the main goal of building a portfolio website for myself, the other two major things are responsiveness and speed. I wanted to not only build a fully responsive site, but also a really fast one. Keeping that in mind, the following describes the tools I used and why.",
      "nuxt": "I decided to use Nuxt.js, because it makes the build process really easy and uses Vue.js. Furthermore, Nuxt lets you create server side rendered applications, which is a huge benefit for SEO. In addition, there is an option to export your website as a static generated Vue application, which greatly improves performance.",
      "tailwind": "For this project, I decided to not use a front-end component library like Bootstrap or Bulma, because they did not fit the design I had in mind for this website. However, I still needed a responsive grid, so I picked Tailwind CSS.",
      "netlify": "To host my portfolio page, I use Netlify. It provides good free usage options and deploying could not be easier. Once setup, Netlify automatically deploys my project from the master branch in my GitLab repository. I simply push changes to the master branch and Netlify does the rest."
    },
    "contact": {
      "title": "Contact",
      "text": "You can reach me under:"
    }
  },
  "projects": {
    "school": "School Projects",
    "work": "Work Projects",
    "personal": "Personal Projects",
    "jada": {
      "title": "JaDa",
      "subtitle": "HTML, JavaScript, LESS, Grunt",
      "content": "JaDa was a project, which took half a year and was realised by a classmate and me. The goal was to get to know new technologies like LESS and Grunt. We decided to build a front-end content library with inspiration from Bootstrap. We thought this would be the best way to work intensively with these technologies."
    },
    "rtvs": {
      "title": "Real Time Voting System",
      "subtitle": "Node.js, RethinkDB, Gulp, Stylus",
      "content": "Like the name suggests, RTVS is a voting system, where the results are displayed in real time. The server logic was built with Node.js. With help of the realtime capabilities of RethinkDB and Socket.io, new data entries are displayed automatically on the client (without the need to reload the page)."
    },
    "hfw": {
      "title": "hello friends Website",
      "subtitle": "PHP, jQuery, CSS",
      "content": "Hello friends is a cashback system, where you get a percentage of your purchase given back as a Friendsbonus. Furthermore, you can order food on the website, as well as in the app and also redeem those earned Friendsbonus points."
    },
    "hfc": {
      "title": "hello friends App",
      "subtitle": "Ionic Framework (Angular, SCSS, HTML, Cordova)",
      "content": "In the corresponding hello friends app, you can also order food and collect a Friendsbonus. The earned Friendsbonus gets stored in the user account and can be redeemed with the QrCode within the app during checkout. The Ionic framework made it possible to develop the app for IOS and Android simultaneously. I alone was responsible for developing and managing the app."
    },
    "hfp": {
      "title": "DELIVERY Partner App",
      "subtitle": "Ionic Framework (Angular, SCSS, HTML, Cordova)",
      "content": "The orders, which are placed from the website or app, can be managed within this app. The partners can print these orders (via bluetooth), change delivery times, show the delivery address on Google Maps etc. DELIVERY Partner was also developed and maintained by myself, but is only available for Android."
    }
  }
}